tap "databricks/tap"
tap "dataders/duckdb"
tap "dbt-labs/dbt-cli"
tap "homebrew/core"
tap "manaflow-ai/cmux"
tap "microsoft/mssql-release"
brew "act"
brew "asciinema"
brew "bat"
brew "cairo"
brew "changie"
brew "colima"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "forgit"
brew "fzf-tab"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "go"
brew "gource"
brew "pango"
brew "graphviz"
brew "htop"
brew "qemu"
brew "lima-additional-guestagents"
brew "node"
brew "openjdk"
brew "openjdk@17"
brew "openjdk@21"
brew "pipx"
brew "pkgconf"
brew "protobuf"
brew "python@3.12"
brew "redis"
brew "rtk"
brew "scala@2.12"
brew "starship"
brew "tailscale", restart_service: :changed
brew "tailspin"
brew "tmux"
brew "trash-cli"
brew "trufflehog"
brew "typescript"
brew "unixodbc"
brew "uv"
brew "wasm-pack"
brew "wget"
brew "worktrunk"
brew "yt-dlp"
brew "zoxide"
brew "databricks/tap/databricks"
brew "dataders/duckdb/duckdb"
brew "dbt-labs/dbt-cli/dbt"
cask "cmux"
cask "codex"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "quarto"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-ssh"
vscode "bastienboutonnet.vscode-dbt"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bungcip.better-toml"
vscode "catppuccin.catppuccin-vsc"
vscode "dakara.transformer"
vscode "darkriszty.markdown-table-prettify"
vscode "davidanson.vscode-markdownlint"
vscode "dbtlabsinc.dbt"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "lucien-martijn.parquet-visualizer"
vscode "mechatroner.rainbow-csv"
vscode "mike-lischke.vscode-antlr4"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "mvllow.rose-pine"
vscode "pkief.material-product-icons"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "takumii.markdowntable"
vscode "teabyii.ayu"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "yzhang.markdown-all-in-one"
go "github.com/rhysd/actionlint/cmd/actionlint"
cargo "cargo-hakari"
cargo "cargo-nextest"
cargo "taplo-cli"
uv "claude-code-transcripts"
uv "dbc"
uv "dbt-autofix"
uv "dbt-mcp"
uv "harlequin", with: ["duckdb==1.4.4"]
uv "openai-whisper"
uv "sqlfluff"
uv "wtg-cli"
